In [ ]:
# 1. for lesson section. 2. for exercise section.
# 1.1 Import data.
# 1.2 Create data from mixed type columns.
# 1.3 Find missing values and create new df.
# 1.4 Clean from duplicates.
# 2. Exercise section. Performed steps above according to exercises.

In [4]:
# import libraries
import pandas as pd
import numpy as np
import os

In [5]:
# define path
path = r'C:\Users\Administrator\Documents\data analytics\Instacart Basket Analysis\02 Data'

In [6]:
# import products (original)
df_prods = pd.read_csv(os.path.join(path, 'Original Data', 'products.csv'), index_col=False)

In [7]:
path

'C:\\Users\\Administrator\\Documents\\data analytics\\Instacart Basket Analysis\\02 Data'

In [8]:
# import orders wrangled
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data', 'orders_wrangled.csv'), index_col=False)

In [9]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [10]:
# Create a dataframe
df_test = pd.DataFrame()

In [11]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [12]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [13]:
# Check for mixed types
for col in df_test.columns:
    expected_type = type(df_test[col].iloc[0])
    weird = df_test[col].apply(lambda x: type(x) != expected_type)
    if weird.any():
         print(col)

mix

In [14]:
# Convert column data tapa from numeric to string
df_test['mix'] = df_test['mix'].astype('str')

In [15]:
# Find missing values in df_prods 
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [16]:
# View missing values from above
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [17]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [18]:
# Run df_prods.shape to check rows (to compare after ops)
df_prods.shape

(49693, 5)

In [19]:
# Create a new data frame with no missing values (false)
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [20]:
# Check if nr of rows have decreased with .shape command
df_prods_clean.shape

(49677, 5)

In [21]:
# Create a subset to df_prods_clean with records that are duplicated
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [22]:
# Display the subset
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [23]:
# Count rows in the clean df
df_prods_clean.shape

(49677, 5)

In [24]:
# Create a dataset with no duplicates (unique rows of df_prods_clean)
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [25]:
df_prods_clean_no_dups.shape

(49672, 5)

In [26]:
# EXERCISE 4.5

In [27]:
# (2) Check data
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [28]:
# Inconsistencies in df_ords (above the exercise section)
# Order day of week cannot have a max of 4 since there are more days.
# Inconsistencies in df_ords
# It is strange that the minimum value is the same over all columns

In [29]:
# (3) Check for mixed types in df_prods
for col in df_prods.columns:
    non_null_values = df_prods[col].dropna()
    if not non_null_values.empty:
        expected_type = type(non_null_values.iloc[0])
        weird = df_prods[col].dropna().apply(lambda x: type(x) != expected_type)
        if weird.any():
            print(col)

product_id
aisle_id
department_id
prices

In [30]:
# (3) Check for mixed types in df_ords
for col in df_ords.columns:
    non_null_values = df_ords[col].dropna()
    if not non_null_values.empty:
        expected_type = type(non_null_values.iloc[0])
        weird = df_ords[col].dropna().apply(lambda x: type(x) != expected_type)
        if weird.any():
            print(col)

order_id
user_id
order_number
orders_day_of_week
order_hour_of_day
days_since_prior_order

In [31]:
# (4) Convert column data types from numeric to string df_prods
cols_to_convert = ['product_id', 'aisle_id', 'department_id', 'prices']
df_prods[cols_to_convert] = df_prods[cols_to_convert].astype('string')

In [32]:
# (4) Convert column data types from numeric to string df_ords
cols_to_convert2 = ['order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order']
df_ords[cols_to_convert2] = df_ords[cols_to_convert2].astype('string')

In [33]:
# (5) Find missing values in df_ords (prods was done above)
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
validation                     0
dtype: int64

In [34]:
# (5) There are 206209 missing values in days since prior order.
# If the last order was done today then no days have passed. How is the 0 registered, as NA?? 
# The missing value can actually also be a real missing entry (data inconsistency).

In [35]:
# (6) View missing values from above
df_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [36]:
# (6) Display the missing value in df_ords
df_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,validation
0,2539329,1,1,2,8,<NA>,prior
11,2168274,2,1,2,11,<NA>,prior
26,1374495,3,1,1,14,<NA>,prior
39,3343014,4,1,6,11,<NA>,prior
45,2717275,5,1,3,12,<NA>,prior
...,...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,<NA>,prior
3420934,3189322,206206,1,3,18,<NA>,prior
3421002,2166133,206207,1,6,19,<NA>,prior
3421019,2227043,206208,1,1,15,<NA>,prior
3421069,3154581,206209,1,3,11,<NA>,prior

In [37]:
# Check the info.  
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,validation
count,3421083,3421083,3421083,3421083,3421083,3214874,3421083
unique,3421083,206209,100,7,24,31,3
top,2539329,152340,1,0,10,30.0,prior
freq,1,100,206209,600905,288418,369323,3214874

In [38]:
# Check nr of records in df_ords
df_ords.shape

(3421083, 7)

In [39]:
df_ords.head(20)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,validation
0,2539329,1,1,2,8,<NA>,prior
1,2398795,1,2,3,7,15.0,prior
2,473747,1,3,3,12,21.0,prior
3,2254736,1,4,4,7,29.0,prior
4,431534,1,5,4,15,28.0,prior
5,3367565,1,6,2,7,19.0,prior
6,550135,1,7,1,9,20.0,prior
7,3108588,1,8,1,14,14.0,prior
8,2295261,1,9,1,16,0.0,prior
9,2550362,1,10,4,8,30.0,prior
10,1187899,1,11,4,8,14.0,train
11,2168274,2,1,2,11,<NA>,prior
12,1501582,2,2,5,10,10.0,prior
13,1901567,2,3,1,10,3.0,prior
14,738281,2,4,2,10,8.0,prior
15,1673511,2,5,3,11,8.0,prior
16,1199898,2,6,2,9,13.0,prior
17,3194192,2,7,2,12,14.0,prior
18,788338,2,8,1,15,27.0,prior
19,1718559,2,9,2,9,8.0,prior

In [40]:
# Check for duplicates
df_dups_ords = df_ords [df_ords.duplicated()]

In [41]:
df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, validation]
Index: []

In [42]:
# I cannot find any duplicates in my df_ords data. 
# I will only address the df_prods duplicates.

In [46]:
from pathlib import Path
path = Path("C:/Users/Administrator/Documents/data analytics/Instacart Basket Analysis/02 Data/Prepared Data")

In [47]:
print(path)

C:\Users\Administrator\Documents\data analytics\Instacart Basket Analysis\02 Data\Prepared Data

In [48]:
# (9) export the df_ords to orders_wrangled
df_ords.to_csv(path/'orders_checked.csv', index=False)

In [49]:
# (9) export the df_prods_clean_no_dups to orders_wrangled
df_prods_clean_no_dups.to_csv(path/'products_checked.csv', index=False)